// Написать программу вычисления значения функции y = sin(a). 
double x,y;
x=3.1415; //x=Math.PI;
y=Math.Sin(x);
System.Console.WriteLine($"sin({x})={y}");
