// Вывести на экран числа от -N до N
int i=-5;
int N=20;
while (i<=N)
{
    System.Console.Write($"{i} "); // пробел после i нужен, чтобы после чисел был пробел
    i=i+1;
}
