// Вывести на экран таблицу квадратов чисел от 1 до N

for (int A = 1, N=9;  A <= N; A++)
{
    System.Console.WriteLine($"{A}*{A}={A*A}");
}