// Вывести на экран кубы чисел от 1 до N

for (int A = 1, N = 9; A <= N; A++)
{
    System.Console.WriteLine($"Куб числа {A} = {A * A * A}");
}
